Classes | Public Member Functions | Protected Member Functions | List of all members
ACAPI::MEP::ModifiableElementBase Class Reference
MEP Element Manager
The ModifiableElementBase contains the available modifying actions for ElementBase. More...
#include <MEPModifiableElementBase.hpp>
 Inheritance diagram for ACAPI::MEP::ModifiableElementBase:
 Classes
class  | Modifier
Modifier of the ModifiableElementBase. More...
 Public Member Functions
template<typename ModifierFunc >
Result< void >  | Modify (const ModifierFunc &modifierFunc, const GS::UniString &undoString)
Executes the passed modifier scope in an Undoable command.
 Public Member Functions inherited from ACAPI::MEP::ElementBase
bool  | Exists () const
std::vector< UniqueID >  | GetPortIDs () const
std::vector< UniqueID >  | GetDirectConnectedMEPElementIds () const
API_Coord3D  | GetAnchorPoint () const
Orientation  | GetOrientation () const
API_Guid  | GetObjectId () const
 Public Member Functions inherited from ACAPI::ElementBase
UniqueID  | GetElemId () const
Get unique identifier of the ElementBase object.
Result< void >  | IsEditable () const
Checks whether the element is editable.
 Public Member Functions inherited from ACAPI::Object
Object (std::shared_ptr< Impl::ObjectImpl > impl)
Constructs a new object.
const API_Token &  | GetToken () const
Get the token for this object.
 Protected Member Functions
ModifiableElementBase (std::shared_ptr< Impl::IElementBaseImpl > impl)
Constructs a ModifiableElementBase with the IElementBaseImpl.
 Protected Member Functions inherited from ACAPI::MEP::ElementBase
ElementBase (std::shared_ptr< Impl::IElementBaseImpl > impl)
Constructs an ElementBase with an element base implementation.
 Protected Member Functions inherited from ACAPI::ElementBase
ElementBase (std::shared_ptr< Impl::ObjectImpl > impl)
Constructs a new ElementBase.
 Protected Member Functions inherited from ACAPI::Object
~Object ()
Default destructor.
 Additional Inherited Members
 Protected Attributes inherited from ACAPI::Object
 std::shared_ptr< Impl::ObjectImpl >  | mImpl
Impl object given by constructor.
Detailed Description
The ModifiableElementBase contains the available modifying actions for ElementBase.
It is a collection of actions regarding common MEP attributes that can be handled through this parent entity.
Since
Archicad 27
Example code snippets from Test / New MEP
Modification
 ACAPI::Result<ModifiableElement> element = ModifiableElement::Get (id);
 if (element.IsErr ()) {
 ACAPI_WriteReport (element.UnwrapErr ().text.c_str (), false);
 return element.UnwrapErr ().kind;
 }
 const API_Coord3D& currentPosition = element->GetAnchorPoint ();
 ACAPI::Result<void> modifyResult = element->Modify ([&currentPosition](ModifiableElement::Modifier& modifier) {
 API_Coord3D position (currentPosition);
 position.x += 5.0;
 modifier.SetAnchorPoint (position);
 Orientation newOrientation = { { 0.0, 1.0, 0.0 }, { 1.0, 0.0, 0.0 } };
 modifier.SetOrientation (newOrientation);
 }, "Change position and orientation of MEP Element.");
 return NoError;
Constructor & Destructor Documentation
◆ ModifiableElementBase()
 ACAPI::MEP::ModifiableElementBase::ModifiableElementBase  |  ( |  std::shared_ptr< Impl::IElementBaseImpl > |  impl | )
protected
Constructs a ModifiableElementBase with the IElementBaseImpl.
Parameters
impl | The element base implementation.
Member Function Documentation
◆ Modify()
 template<typename ModifierFunc >
 Result< void > ACAPI::MEP::ModifiableElementBase::Modify  |  ( |  const ModifierFunc & |  modifierFunc,
|  const GS::UniString & |  undoString )
Executes the passed modifier scope in an Undoable command.
Parameters
modifierFunc | The modifier scope (lambda, std::function or function pointer) the caller wants to execute.
undoString | The text which appears in the undo queue of Archicad after executing the command.
Returns
Returns an error if the process of modification fails for some reason, otherwise nothing.